Mizuho32/esp32-kvm-ip/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# 8MB flash (mds/usb_hid/2026-08-28_mruby_filter_route.md's target
# hardware) - custom partitions.csv gives the app partition 3MB, well
# above the default table's 1MB (mruby alone pushes the Host role image
# past 2MB) with headroom for growth and the Phase2 script-storage
# partition that design doc's next step will add.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 16384 (default 3584, previously bumped to 8192): app_main() (task
# "main") calls mruby_filter_init() on this task, and mruby's VM init +
# Prism parser overflowed the default stack on real hardware - see
# mds/usb_hid/2026-08-29_mruby_phase1_impl.md. 8192 was enough for that
# alone, but overflowed again once mruby_webui_start() (Phase 2,
# mds/usb_hid/2026-08-30_mruby_phase2_webui.md) - which also runs on
# this task and calls esp_http_server's httpd_start() - was added later
# in the same app_main() sequence. The overflow backtrace itself doesn't
# show the actual offending call site (ESP-IDF's stack-overflow
# detection unwinds the context-switch/panic path, not the corrupted
# task's own frames), so this is sized with headroom rather than tuned
# to an exact measurement. Only costs memory transiently during boot -
# task "main"'s stack is freed once app_main() returns.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# USB OTG (ESP32-S3 native USB)
CONFIG_TINYUSB_HID_COUNT=3

# Boards like Seeed XIAO ESP32S3 expose only a single USB-C port wired to
# the native USB pins (GPIO19/20). Once TinyUSB claims that port as the
# Boot Keyboard/Mouse device, it can no longer also serve as a USB-Serial-
# JTAG console. Route the console to UART0 instead (XIAO silkscreen D6/D7 =
# GPIO43/44 = default UART0 TX/RX) so logs stay available via an external
# USB-UART adapter. Flashing is unaffected - it uses the ROM bootloader's
# own download-mode driver on the same port, independent of this setting.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Runtime per-task CPU stats (vTaskGetRunTimeStats()) - used to find
# what's starving usb_host_rp2040_bridge.c's bridge_task for tens of ms
# at a time (mds/usb_hid/2026-08-24_rp2040_bridge_fps_investigation.md). Trace
# facility is a prerequisite for the runtime-stats option.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# USB Host (Host role only, KVM_ROLE=HOST) - enables Hub-connected devices.
# Harmless when unused (Device role never installs the USB Host driver).
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# PSRAM (Seeed XIAO ESP32S3 uses an ESP32-S3R8 module - 8MB Octal PSRAM
# in-package, matching mds/usb_hid/2026-08-28_mruby_filter_route.md's
# "想定ハードウェア"). Added to fix an intermittent WebUI "out of memory"
# 500 that came from competing with mruby's VM heap/task stacks for the
# ~300-400K of internal SRAM alone - see
# mds/usb_hid/2026-08-30_mruby_phase2_webui.md.
#
# SPIRAM_USE_CAPS_ALLOC (not the default SPIRAM_USE_MALLOC) deliberately
# keeps plain malloc() internal-only - mruby's VM heap and the
# latency-sensitive mouse dispatch path (mds/usb_hid/2026-08-24_rp2040_bridge_fps_investigation.md)
# are untouched by this change. Only main/mruby_webui.c's own buffers
# explicitly opt in via heap_caps_malloc(..., MALLOC_CAP_SPIRAM).
#
# SPIRAM_IGNORE_NOTFOUND: if this assumption about the board's PSRAM is
# wrong (wrong module variant, or genuinely absent), boot proceeds
# without PSRAM instead of aborting - mruby_webui.c's heap_caps_malloc()
# calls then simply return NULL and fall back to regular malloc(), same
# behavior as before this change (see mruby_webui.c's webui_alloc()).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# Bluetooth (Host role only, KVM_ROLE=HOST - ble_hid_device.c). NimBLE,
# not Bluedroid: ESP32-S3 has no Classic BT/BR-EDR anyway, and NimBLE is
# Espressif's own recommendation for BLE-only use cases to save memory -
# see mds/usb_hid/2026-09-07_ble_hid_sink_plan.md. Enabling this alone
# doesn't cost the Device role anything - the "bt"/"esp_hid" components
# only actually get linked in where main/CMakeLists.txt's HOST role
# PRIV_REQUIRES pulls them in (confirmed empirically: enabling these
# Kconfig options with nothing requiring the component produces an
# identical binary size to not enabling them at all).
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# esp_hid's NimBLE HOGP backend (nimble_hidd.c) is entirely compiled out
# without this - defaults to n upstream since most NimBLE users don't
# need a HID *service* (as opposed to just BLE in general). Its default
# CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=3 already matches ble_hid_device.c's
# 3 report IDs (keyboard/mouse/consumer), so left unset.
CONFIG_BT_NIMBLE_HID_SERVICE=y

# NimBLE's own host-stack logging (tag "NimBLE" - MODLOG_DFLT()/BLE_HS_LOG()
# calls sprinkled through the host source and esp_hid_gap.c's vendored GAP
# event handler alike) defaults to INFO, which prints a line for every
# single GATT notification sent ("notify_tx event"), every "GATT procedure
# initiated: ..." and low-level ATT ("att_...") exchange - i.e. once per
# HID report while BLE is in use. That's both console noise and (this
# project has already measured blocking UART console output as a real
# latency source on this exact hot path - see
# mds/usb_hid/2026-08-24_rp2040_bridge_fps_investigation.md) a likely
# contributor to BLE motion feeling laggier than type-c/UDP. Dropping to
# WARNING keeps real problems (encryption failures etc., which our own
# esp_hid_gap.c logs at ESP_LOGW under the separate "ESP_HID_GAP" tag -
# unaffected by this, since that's a plain esp_log tag/level, not
# NimBLE's own BT_NIMBLE_LOG_LEVEL) visible while silencing the routine
# per-report chatter.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# Root cause of the reconnect-after-reset encryption-failure loop
# (mds/usb_hid/2026-09-07_ble_hid_sink_impl.md's follow-up:
# "encryption change event; status=7" / disconnect reason=517, looping
# forever on every reconnection attempt after any reset). Diagnosed via
# a temporary DEBUG-level NimBLE capture: on every failing attempt the
# host logs "looking up our sec; peer_addr=..." immediately followed by
# an HCI LE Long Term Key Request *Negative* Reply (ocf=0x001b) - i.e.
# ble_store_config (NimBLE's default bond store, wired up in
# ble_hid_device.c's ble_store_config_init() call) genuinely had no LTK
# on file for that peer. Root cause: BT_NIMBLE_NVS_PERSIST defaults to
# n, so that store is RAM-only and silently loses every bond on reset
# regardless of pairing method - which is also why bumping the nvs
# partition size and toggling sm_sc earlier both had zero effect: NVS
# was never actually being written to in the first place. Confirmed via
# grepping the DEBUG capture for "nvs_open_from_partition nimble_bond" -
# it never appeared once.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
